RIET/src/Documents/SanctionListHTCcode/SanctionListHTCcode.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>SanctionListHTCcode</name>
  <posting>Deny</posting>
  <attributes>
    <name>SanctionsGroup</name>
    <type>
      <types>CatalogRef.SanctionsGroup</types>
    </type>
  </attributes>
  <attributes>
    <name>Country</name>
    <type>
      <types>CatalogRef.CountriesOfProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>HTCCodeList</name>
    <attributes>
      <name>HTCCode</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>StartDate</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ExpiryDate</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>EnglishDescription</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>RussianDescription</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/Documents/SanctionListHTCcode/ObjectModule.bsl
//////////////////////////////////////////////////////////////////////
// ПРИ КОПИРОВАНИИ

Процедура ПриКопировании(ОбъектКопирования)
	
	РГСофт.ОчиститьCreationModification(ЭтотОбъект);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////
// ПЕРЕД ЗАПИСЬЮ      

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДозаполнитьРеквизиты();
	
	ПроверитьРеквизиты(Отказ, РежимЗаписи);
		
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////////////

Процедура ДозаполнитьРеквизиты()
	
	Comment = СокрЛП(Comment);
	РГСофтКлиентСервер.СокрЛПКолонокВТаблице(HTCCodeList, "HTCCode");
	ОбщегоНазначения.ОчиститьТаблицуОтСтрокСПустымиРеквизитами(HTCCodeList, "HTCCode");

	Если ЭтоНовый() Тогда
		CreatedBy = ПараметрыСеанса.ТекущийПользователь;
		Дата = ТекущаяДата();
	Иначе 
		РГСофт.ЗаполнитьModification(ЭтотОбъект);
	КонецЕсли;
		
КонецПроцедуры 


///////////////////////////////////////////////////////////////////////////////////////

Процедура ПроверитьРеквизиты(Отказ, РежимЗаписи)
	
	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	     		
	Если Не ЗначениеЗаполнено(SanctionsGroup) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"'Sanctions group' is empty!",
			ЭтотОбъект, "SanctionsGroup", , Отказ);
			
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Country) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"'Country' is empty!",
			ЭтотОбъект, "Country", , Отказ);
			
	КонецЕсли;
		
	Если HTCCodeList.Количество() = 0 Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"""HTC code list"" is empty!",
			ЭтотОбъект, "HTCCodeList", , Отказ);
			
	иначе
		
		МассивHTCCode = РГСофтКлиентСервер.ВыгрузитьКолонкуКоллекцииБезПустыхЗначенийИДублей(HTCCodeList, "HTCCode");
		СтруктураПоиска = Новый Структура("HTCCode");
		
		Для Каждого HTCCode из МассивHTCCode Цикл
			
			СтруктураПоиска.HTCCode = HTCCode;
			
			МассивСтрок = HTCCodeList.НайтиСтроки(СтруктураПоиска);
			Если МассивСтрок.Количество() > 1 Тогда 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					"HTC code " + HTCCode + " specified more than once!",
					ЭтотОбъект, "HTCCodeList", , Отказ);	
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого СтрокаHTCCodeList из HTCCodeList Цикл 
			    						
			Если Не ЗначениеЗаполнено(СтрокаHTCCodeList.StartDate) Тогда
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					"For HTC code " + СтрокаHTCCodeList.HTCCode + " start date is empty!",
					ЭтотОбъект, "HTCCodeList[" + (СтрокаHTCCodeList.НомерСтроки-1) + "].StartDate", , Отказ);
				
			КонецЕсли; 			   	 			
			
		КонецЦикла;
		
	КонецЕсли;
		        		
КонецПроцедуры
